app/controllers/school_classes_controller.rb

    def update
        find_school_class
        @school_class = SchoolClass.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2019-06-03 22:59:41.272838"], ["id", 1]]